Revit 2027 API
DisciplineTypeId.Structural Property
 Structural.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId Structural { get; }
Public Shared ReadOnly Property Structural As ForgeTypeId
	Get
public:
static property ForgeTypeId^ Structural {
	ForgeTypeId^ get ();
}
static member Structural : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
DisciplineTypeId Class
Autodesk.Revit.DB Namespace